{
  "Played for Real Madrid and Manchester United": [
    "Cristiano Ronaldo scored 450 goals for Real Madrid before becoming United's record signing.",
    "David Beckham won league titles at both clubs and was famous for his trademark free-kicks."
  ],
  "Played for Arsenal and Barcelona": [
    "Thierry Henry finished his prime at Barcelona, winning the treble in 2009.",
    "Cesc Fàbregas returned to Arsenal after winning multiple titles with Barcelona."
  ],
  "Played for Bayern Munich and Borussia Dortmund": [
    "Robert Lewandowski won back-to-back Bundesliga titles with Dortmund and Bayern.",
    "Mats Hummels captained Dortmund before moving to Bayern for a domestic double."
  ],
  "Played for Paris Saint-Germain and Barcelona": [
    "Neymar moved for a world-record fee from Barcelona to PSG in 2017.",
    "Dani Alves won 23 trophies with Barcelona before becoming PSG's most decorated player."
  ],
  "Goalkeepers with 100+ international caps": [
    "Gianluigi Buffon holds the record for most caps by an Italian player.",
    "Iker Casillas won the 2010 World Cup as Spain's captain and amassed 167 caps."
  ],
  "Won the Premier League Golden Boot multiple times": [
    "Alan Shearer won the Golden Boot three times and remains the Premier League's all-time top scorer.",
    "Harry Kane won back-to-back Golden Boots in 2016–17 and 2017–18 with Tottenham."
  ],
  "African Footballer of the Year (2010–2024)": [
    "Yaya Touré won in 2011 after leading Manchester City to FA Cup glory.",
    "Mohamed Salah won in 2018 after breaking Liverpool's single-season scoring record."
  ],
  "Played for Inter Milan and Juventus": [
    "Andrea Pirlo won multiple Serie A titles with both Juve and Milan before coaching Juventus.",
    "Leonardo Bonucci captained Juventus to six consecutive Scudetti after spells at both clubs."
  ],
  "Played for Real Madrid and Chelsea": [
    "Eden Hazard won the Europa League with Chelsea before starring for Real Madrid.",
    "Claude Makélélé redefined the defensive midfield role at both clubs in the early 2000s."
  ],
  "Scored 50+ international goals": [
    "Ali Daei was the first player to score over 100 international goals.",
    "Robert Lewandowski surpassed 70 international goals for Poland by 2022."
  ],
  "Captained their country to a European Championship title": [
    "Iker Casillas captained Spain to Euro 2008 and 2012 triumphs.",
    "Cristiano Ronaldo led Portugal to Euro 2016 victory as captain."
  ],
  "Won Copa América and UEFA Champions League": [
    "Lionel Messi has won four Champions Leagues and one Copa América title.",
    "Carlos Tévez lifted the Champions League with Manchester United in 2008 and Copa América with Argentina in 2004."
  ],
  "Scored a hat-trick in a Champions League knockout match": [
    "Erling Haaland scored a Champions League quarter-final hat-trick on his debut for Borussia Dortmund.",
    "Kylian Mbappé netted a hat-trick in the 2017–18 Round of 16 for PSG."
  ],
  "Played for Atlético Madrid and Chelsea": [
    "Fernando Torres won the Champions League with Chelsea after leaving Atlético.",
    "Diego Costa scored 52 goals in 89 appearances for Atlético before joining Chelsea."
  ],
  "FIFA World Cup Golden Ball winners": [
    "Ronaldo Nazário won Golden Ball in 1998 despite Brazil losing in the final.",
    "Luka Modrić claimed Golden Ball in 2018 after leading Croatia to the final."
  ],
  "Won the UEFA Champions League with two different clubs": [
    "Clarence Seedorf remains the only player to win Champions League with three clubs.",
    "Xabi Alonso won with Liverpool in 2005 and Real Madrid in 2014."
  ],
  "Won both Premier League and La Liga titles": [
    "Yaya Touré won Premier League medals before clinching La Liga with Barcelona in 2010–11.",
    "Cesc Fàbregas won La Liga at 23 and later won the Premier League with Arsenal."
  ],
  "Played for Everton and Manchester United": [
    "Wayne Rooney became United’s record goal scorer after starting at Everton.",
    "Romelu Lukaku was Everton’s top scorer before moving to Manchester United in 2017."
  ],
  "FIFA Puskás Award winners": [
    "Mohamed Salah won the 2018 Puskás for a stunning solo goal against Everton.",
    "Son Heung-min won the 2020 Puskás Award for his solo run goal vs. Burnley."
  ],
  "Scored on Premier League debut": [
    "Marcus Rashford scored twice on his Premier League debut for United at age 18.",
    "Sergio Agüero netted in his debut season to become City's all-time record scorer."
  ],
  "Golden Boy award winners": [
    "Pedri won Golden Boy in 2021 after a breakout season at Barcelona.",
    "Kylian Mbappé won in 2017 as the youngest ever recipient at age 18."
  ],
  "UEFA Men's Player of the Year winners": [
    "Jorginho won the award in 2021 after Champions League success with Chelsea.",
    "Virgil van Dijk broke Messi/Ronaldo duopoly by winning in 2019."
  ],
  "Played for both AC Milan and Inter Milan": [
    "Hernán Crespo scored over 100 Serie A goals across both Milan clubs.",
    "Clarence Seedorf won Champions League with both Milan clubs in 2003 and 2007."
  ],
  "Wore the number 7 shirt for Manchester United": [
    "David Beckham made the number 7 shirt iconic during his United career.",
    "Edinson Cavani wore #7 and scored 17 goals in his debut season."
  ],
  "Transfers worth €100 million or more": [
    "Neymar's €222m move to PSG remains the most expensive transfer ever.",
    "João Félix’s €126m transfer to Atlético Madrid broke club records."
  ],
  "Won the UEFA Champions League as player and manager": [
    "Pep Guardiola won the Champions League as Barcelona’s manager in 2009 and 2011.",
    "Zinedine Zidane won as Real Madrid manager in 2016 after starring as a player."
  ],
  "South American players who won the Premier League": [
    "Fernandinho won four Premier League titles with Manchester City.",
    "Gabriel Jesus scored in his debut season to help City win the league."
  ],
  "Defenders with 10+ Premier League goals": [
    "Leighton Baines scored 45 PL goals mostly from free-kicks for Everton.",
    "Marcos Alonso scored 15 PL goals for Chelsea between 2016–2019."
  ],
  "European Championship Golden Boot winners": [
    "David Villa’s 5 goals in Euro 2008 won him the Golden Boot.",
    "Antoine Griezmann won Golden Boot at Euro 2016 with 6 goals."
  ],
  "Players named Luis who have played for Liverpool": [
    "Luis Suárez won the PL Golden Boot in 2013–14 for Liverpool.",
    "Luis Díaz became a fan favorite after scoring on his debut in 2022."
  ]
}