{
  "Played for Real Madrid and Manchester United": [
    "Cristiano Ronaldo scored 450 goals for Real Madrid before becoming United's record signing.",
    "David Beckham won league titles at both clubs and was famous for his trademark free-kicks."
  ],
  "Played for Arsenal and Barcelona": [
    "Thierry Henry finished his prime at Barcelona, winning the treble in 2009.",
    "Cesc Fàbregas rejoined Barcelona in 2011 and won multiple trophies before returning to the Premier League."
  ],
  "Played for Bayern Munich and Borussia Dortmund": [
    "Robert Lewandowski won back-to-back Bundesliga titles with Dortmund and Bayern.",
    "Mats Hummels captained Dortmund before moving to Bayern for a domestic double."
  ],
  "Played for Paris Saint-Germain and Barcelona": [
    "Neymar moved for a world-record fee from Barcelona to PSG in 2017.",
    "Dani Alves won 23 trophies with Barcelona before becoming PSG's most decorated player."
  ],
  "Stoke City players with 200+ Premier League appearances": [
      "Ryan Shawcross holds Stoke's all-time Premier League appearance record with 317 matches.",
      "Glenn Whelan amassed over 300 games in all competitions and became Stoke's most capped Irish international while at the club.",
      "Peter Crouch played 225 Premier League games for Stoke, becoming their record top-flight goalscorer with 46 goals.",
      "Robert Huth made 149 Premier League appearances for Stoke before helping Leicester City to the 2015–16 title.",
      "Erik Pieters featured in 169 Stoke league matches, regularly anchoring the left-back position.",
      "Jon Walters racked up 226 appearances across all competitions, with 202 in the Premier League."
  ],
  "Goalkeepers with 100+ international caps": [
    "Gianluigi Buffon holds the record for most caps by an Italian player.",
    "Iker Casillas won the 2010 World Cup as Spain's captain and amassed 167 caps."
  ],
  "Won the Premier League Golden Boot multiple times": [
    "Alan Shearer won the Golden Boot three times and remains the Premier League's all-time top scorer.",
    "Harry Kane won back-to-back Golden Boots in 2016–17 and 2017–18 with Tottenham."
  ],
  "African Footballer of the Year (2010–2024)": [
    "Yaya Touré won in 2011 after leading Manchester City to FA Cup glory.",
    "Mohamed Salah won in 2018 after breaking Liverpool's single-season scoring record."
  ],
  "Played for Inter Milan and Juventus": [
    "Andrea Pirlo won multiple Serie A titles with both Juve and Milan before coaching Juventus.",
    "Leonardo Bonucci captained Juventus to six consecutive Scudetti after spells at both clubs."
  ],
  "Played for Real Madrid and Chelsea": [
    "Eden Hazard won the Europa League with Chelsea before starring for Real Madrid.",
    "Claude Makélélé redefined the defensive midfield role at both clubs in the early 2000s."
  ],
  "Scored 50+ international goals": [
    "Ali Daei was the first player to score over 100 international goals.",
    "Robert Lewandowski surpassed 70 international goals for Poland by 2022."
  ],
  "Won Copa América and UEFA Champions League": [
    "Lionel Messi has won four Champions Leagues and one Copa América title.",
    "Carlos Tévez lifted the Champions League with Manchester United in 2008 and Copa América with Argentina in 2004."
  ],
  "Scored a hat-trick in a Champions League knockout match": [
    "Erling Haaland scored a Champions League quarter-final hat-trick on his debut for Borussia Dortmund.",
    "Kylian Mbappé netted a hat-trick in the 2017–18 Round of 16 for PSG."
  ],
  "Played for Atlético Madrid and Chelsea": [
    "Fernando Torres won the Champions League with Chelsea after leaving Atlético.",
    "Diego Costa scored 52 goals in 89 appearances for Atlético before joining Chelsea."
  ],
  "FIFA World Cup Golden Ball winners": [
    "Ronaldo Nazário won Golden Ball in 1998 despite Brazil losing in the final.",
    "Luka Modrić claimed Golden Ball in 2018 after leading Croatia to the final."
  ],
  "Won the UEFA Champions League with two different clubs": [
    "Clarence Seedorf remains the only player to win Champions League with three clubs.",
    "Xabi Alonso won with Liverpool in 2005 and Real Madrid in 2014."
  ],
  "Won both Premier League and La Liga titles": [
    "Yaya Touré won Premier League medals before clinching La Liga with Barcelona in 2010–11.",
    "Cesc Fàbregas won La Liga at 23 and later won the Premier League with Arsenal."
  ],
  "Played for Everton and Manchester United": [
    "Wayne Rooney became United’s record goal scorer after starting at Everton.",
    "Romelu Lukaku was Everton’s top scorer before moving to Manchester United in 2017."
  ],
  "FIFA Puskás Award winners": [
    "Mohamed Salah won the 2018 Puskás for a stunning solo goal against Everton.",
    "Son Heung-min won the 2020 Puskás Award for his solo run goal vs. Burnley."
  ],
  "Scored on Premier League debut": [
    "Marcus Rashford scored twice on his Premier League debut for United at age 18.",
    "Sergio Agüero netted in his debut season to become City's all-time record scorer."
  ],
  "Golden Boy award winners": [
    "Pedri won Golden Boy in 2021 after a breakout season at Barcelona.",
    "Kylian Mbappé won in 2017 as the youngest ever recipient at age 18."
  ],
  "UEFA Men's Player of the Year winners": [
    "Jorginho won the award in 2021 after Champions League success with Chelsea.",
    "Virgil van Dijk broke Messi/Ronaldo duopoly by winning in 2019."
  ],
  "Played for both AC Milan and Inter Milan": [
    "Hernán Crespo scored over 100 Serie A goals across both Milan clubs.",
    "Clarence Seedorf won Champions League with both Milan clubs in 2003 and 2007."
  ],
  "Wore the number 7 shirt for Manchester United": [
    "David Beckham made the number 7 shirt iconic during his United career.",
    "Edinson Cavani wore #7 and scored 17 goals in his debut season."
  ],
  "Transfers worth €100 million or more": [
    "Neymar's €222m move to PSG remains the most expensive transfer ever.",
    "João Félix’s €126m transfer to Atlético Madrid broke club records."
  ],
  "South American players who won the Premier League": [
    "Fernandinho won four Premier League titles with Manchester City.",
    "Gabriel Jesus scored in his debut season to help City win the league."
  ],
  "Defenders with 10+ Premier League goals": [
    "Leighton Baines scored 45 PL goals mostly from free-kicks for Everton.",
    "Marcos Alonso scored 15 PL goals for Chelsea between 2016–2019."
  ],
  "European Championship Golden Boot winners": [
    "David Villa’s 5 goals in Euro 2008 won him the Golden Boot.",
    "Antoine Griezmann won Golden Boot at Euro 2016 with 6 goals."
  ],
  "Played for Real Madrid and Juventus": [
    "Zinedine Zidane joined Real Madrid from Juventus in 2001 for a world-record fee at the time.",
    "Cristiano Ronaldo scored 21 Serie A goals in his debut season at Juventus after nine trophy-laden years at Real Madrid."
  ],
  "Played for Arsenal and Chelsea": [
    "Ashley Cole won two Premier League titles with Chelsea after leaving Arsenal's 'Invincibles' squad in 2006.",
    "Cesc Fàbregas left Arsenal to join Barcelona, then returned to London and won two Premier League titles with Chelsea."
  ],
  "Played for Chelsea and Liverpool": [
    "Fernando Torres scored 81 goals for Liverpool before a £50m move to Chelsea where he won the 2012 Champions League.",
    "Daniel Sturridge won the Champions League with Chelsea in 2012 and later became Liverpool’s top scorer in the 2013–14 season."
  ],
  "Played for Arsenal and Manchester City": [
    "Kolo Touré and Gaël Clichy were part of Arsenal's 2004 Invincibles before winning Premier League titles with Manchester City.",
    "Samir Nasri was Arsenal’s Player of the Season in 2010–11 and later won two league titles after his transfer to Man City."
  ],
  "Played for Liverpool and Manchester City": [
    "Raheem Sterling moved from Liverpool to Man City in 2015 and won four Premier League titles at City.",
    "James Milner won two league titles with Man City and later lifted the Champions League with Liverpool in 2019."
  ],
  "Played for Real Madrid and Tottenham Hotspur": [
    "Gareth Bale became the world's most expensive player in 2013 when he moved from Spurs to Real, going on to win four Champions League titles with Madrid.",
    "Luka Modrić left Tottenham for Real Madrid in 2012 and won the 2018 Ballon d'Or after four Champions League triumphs."
  ],
  "Played for Arsenal and Juventus": [
    "Thierry Henry had a brief spell at Juventus in 1999 before becoming Arsenal's all-time leading scorer.",
    "Wojciech Szczęsny won multiple Serie A titles with Juventus after leaving Arsenal in 2017."
  ],
  "Played for AC Milan and Juventus": [
    "Andrea Pirlo won two Champions League titles with AC Milan before joining Juventus and winning four Serie A titles.",
    "Leonardo Bonucci spent one season at AC Milan in 2017–18 between seven consecutive Serie A titles with Juventus."
  ],
  "Played for Real Madrid and Liverpool": [
    "Steve McManaman became the first English player to win the Champions League with a foreign club when he scored in Real Madrid's 2000 final win.",
    "Xabi Alonso won the Champions League with Liverpool in 2005 and again with Real Madrid in 2014."
  ],
  "Played for Barcelona and Chelsea": [
    "Eidur Gudjohnsen scored 78 goals for Chelsea before transferring to Barcelona in 2006 and winning the Champions League in 2009.",
    "Cesc Fàbregas came through Barcelona’s academy and later helped Chelsea win two Premier League titles."
  ],
  "Played for AC Milan and Barcelona": [
    "Ronaldinho won the 2005 Ballon d'Or as a Barcelona player before joining AC Milan in 2008.",
    "Zlatan Ibrahimović scored 16 league goals for Barcelona in 2009–10 and later led AC Milan to the Serie A title in 2011."
  ],
  "Won league titles in 3 of Europe's top 5 leagues": [
    "Cristiano Ronaldo became the first player to win league titles in England, Spain and Italy.",
    "Zlatan Ibrahimović won Serie A with three clubs and also lifted league trophies in Spain and France."
  ],
  "Spent entire professional career at one club": [
    "Francesco Totti spent 24 seasons at Roma, becoming the club's record goalscorer and appearance maker.",
    "Ryan Giggs made a club-record 963 appearances for Manchester United, winning 13 Premier League titles without a single transfer."
  ],
  "Scored in multiple Champions League finals": [
    "Cristiano Ronaldo scored in three Champions League finals (2008, 2014, 2017), more than any other player.",
    "Gareth Bale is one of few players to score in two Champions League finals, including a famous bicycle kick in 2018."
  ],
  "FIFA World Cup Golden Boot winners (2002–2022)": [
    "Miroslav Klose won the 2006 Golden Boot and retired as the World Cup's all-time top scorer with 16 goals.",
    "Kylian Mbappé scored a hat-trick in the 2022 World Cup final, earning him the Golden Boot at age 23."
  ]
}